#include "lab3.h"

// здесь должен быть код методов и различные эксперименты

/**
 * Алгоритм решения слау прямым методом на основе LU-разложения
 * На вход подается матрица профильного формата
 * На выходе вектор x - одно из решений слау (если есть)
 * */
std::vector<double> lu_solving(profile_matrix m) {

}

/**
 * Алгоритм решеия слау двупроходным методом Гаусса с выбором ведущего элемента
 * На вход подается матрица плотного формата
 * На выходе вектор x - одно из решений слау (если есть)
 * */
std::vector<double> gauss(matrix_ m) {

}